app/controllers/aboutus_controller.rb

  def index
    @aboutus = Aboutu.all
---
SELECT * FROM `aboutus`

  def show
    @aboutu = Aboutu.find(params[:id])
---
SELECT * FROM `aboutus` WHERE (`aboutus`.`id` = 1)

  def create
    @aboutu = Aboutu.new(params[:aboutu])

    respond_to do |format|
      if @aboutu.save
---
INSERT INTO `aboutus` (`created_at`, `updated_at`) VALUES('2010-10-23 04:10:50', '2010-10-23 04:10:50')