app/controllers/disclaimers_controller.rb

  def index
    @disclaimers = Disclaimer.all
---
SELECT * FROM `disclaimers`