app/controllers/pastprojects_controller.rb

SELECT * FROM `pastprojects`
---
  def index
    @pastprojects = Pastproject.all