app/controllers/servicesandproducts_controller.rb

  def index
    @servicesandproducts = Servicesandproduct.all
---
SELECT * FROM `servicesandproducts`