app/controllers/terms_controller.rb

SELECT * FROM `terms`
---
  def index
    @terms = Term.all